<?php
$h2 = '手工艺';

function mainview() {
    $text = '手工箭 --> 木柴 5, 短弓用的箭捆
高档手工箭 --> 木柴 5, 高档短弓用的箭捆
轻便桌子 --> 木柴 5, 铁钉 10
手工弩箭 --> 木柴 4, 弩箭捆
高档手工弩箭 --> 木柴 4, 高档弩箭捆
多功能汤勺 --> 木柴 3
擀面杖 --> 木柴 2
魔法粉 --> 蓝色小珠子, 基础药草
魔法粉 --> 红色小珠子, 基础药草
魔法粉 --> 银色小珠子, 基础药草
纸鹤 --> 纸
纸帽子 --> 旅行者向导书籍
鱼竿 --> 木棍, 细线团
幽灵剑 --> 廉价皮带, 幽灵体液
手工绷带 --> 廉价布料
高档手工绷带 --> 普通布料
伊比地下城通行证(用于复原破损的女神像) --> 魔族的指令书(伊比地下城), 圣水, 魔法药草
赛尔地下城通行证(用于复原破损的女神像) --> 魔族的指令书(赛尔地下城), 圣水, 魔法药草
拉比地下城通行证(用于复原破损的女神像) --> 魔族的指令书(拉比地下城), 圣水, 魔法药草
玛斯地下城通行证(用于复原破损的女神像) --> 魔族的指令书(玛斯地下城), 圣水, 魔法药草
菲奥纳地下城通行证(用于复原破损的女神像) --> 魔族的指令书(菲奥纳地下城), 圣水, 魔法药草
克丽尔地下城通行证(用于复原破损的女神像) --> 魔族的指令书(克丽尔地下城), 圣水, 魔法药草
伦达地下城通行证(用于复原破损的女神像) --> 魔族的指令书(伦达地下城), 圣水, 魔法药草
皮卡地下城 通行证(用于复原破损的女神像) --> 魔族的指令书(皮卡地下城), 圣水, 魔法药草
巴里地下城 通行证(用于复原破损的女神像) --> 魔族的指令书(巴里地下城), 圣水, 魔法药草
保护链条 --> 米斯里线
抗魔之布 --> 高档丝绸 2, 圣水 2, 魔法药草 2
灵魂药水 --> 装灵魂的瓶子, 看的见灵魂的粉, 听的到灵魂声音的水
手工艺箱 --> 木柴 3, 铁钉 5
制作药水工具 --> 木柴 2, 铁钉 4
最高档手工箭 --> 木柴 5, 最高档短弓用的箭捆
最高档手工弩箭 --> 木柴 4, 最高档弩箭捆
最高档手工绷带 --> 高档布料
钓物品 W22 --> 铁棒, 结实的线, 魔法金线, 魔法银线
物品幻想 T46 --> 铁板 2, 木板 2, 铁钉 2, 食物垃圾 5
岩石伪装装饰 --> 木板 2, 纸 4
娜儿伪装装饰 --> 木板 3, 纸 3
草丛伪装装饰 --> 木板 2, 纸 2
树伪装装饰 --> 木板 3, 纸 2
太阳伪装装饰 --> 木板 2, 纸 3
木板 --> 木柴 5, 铁钉 5, 铁棒 2, 结实的绳子 2
台灯 --> 木板 3, 普通布料 3
小桌子 --> 木板 3, 普通布料 3, 铁钉 5
木鸟笼 --> 木板 3, 结实的线 3, 铁钉 5
最高档皮带专用纺织机 --> 木板 3, 铁钉 8, 结实的线 8
高档皮带专用纺织机 --> 木板 3, 铁钉 4, 结实的线 4
布料专用织布机 --> 木板 2, 铁钉 6, 结实的线 6
丝绸专用织布机 --> 木板 2, 铁钉 4, 结实的线 4
鱼骨剑 --> 翻车鱼骨头
剥了皮的豆子 --> 豆子
阿维卡盾牌 --> 木柴, 阿维卡影子
光之冰剑 --> 光之冰霜结晶, 碎冰块
冰剑 --> 冰霜结晶, 碎冰块
雪球 --> 雪 5
圣诞节用的装饰品 --> 粗线团, 小珠子 5, 树枝 5, 钉子 5
弩炮用手工制弹药 --> 木材 6, 弩箭捆
弩炮用高档手工制弹药 --> 木材 6, 高档弩箭捆
弩炮用最高档手工制弹药 --> 木材 6, 最高档弩箭捆
弩炮用飞龙利爪弹药 --> 木材, 双足飞龙的爪子
弩炮用有毒的飞龙利爪弹药 --> 木材, 双足飞龙的爪子, 毒药水
弩炮用伊诺德的弹药 --> 弩炮用弹药, 伊诺德结晶, 硫磺 7
透明的水晶珠子 --> 复原的蓝色水晶珠子, 复原的红色水晶珠子, 复原的白色水晶珠子
闪亮的钻石 --> 透明的水晶珠子 2, 钻石
绿色颜料 --> 基础药草, 装有水的瓶子, 泊利内鲤鱼
红色颜料 --> 血红药草, 装有水的瓶子, 泊利内鲤鱼
黄色颜料 --> 阳光药草, 装有水的瓶子, 泊利内鲤鱼
青色颜料 --> 魔法药草, 装有水的瓶子, 泊利内鲤鱼
金色颜料 --> 黄金药草, 装有水的瓶子, 泊利内鲤鱼
白色颜料 --> 白色药草, 装有水的瓶子, 泊利内鲤鱼
黑色颜料 --> 无法使用的药草, 装有水的瓶子, 泊利内鲤鱼
紫色颜料 --> 毒药草, 装有水的瓶子, 泊利内鲤鱼
人偶完美修理道具箱 --> 铁匠榔头, 裁缝工具箱, 金板, 高级木柴, 高级布料
人偶高级修理工具盒 --> 铁匠榔头, 裁缝工具箱, 银板, 中级木柴, 普通布料
人偶修理道具箱 --> 铁匠榔头, 铜板, 木柴
恶魔无尽噬魂法杖 --> 恶魔之眼, 恶魔之爪, 恶魔之刃, 恶魔方块 20
恶魔梦幻操纵杆 --> 恶魔之眼 2, 恶魔方块 20
恶魔恐惧逐梦者 --> 恶魔之眼, 恶魔之爪 2, 恶魔方块 15
蛛网陷阱 --> 细线团
龙的骨头 --> 龙骨碎片 2, 
宴席 --> 木材 5, 铁钉 10, 红色颜料
孔明灯 --> 孔明灯制作工具
凯尔特束缚操纵杆 --> 特级木柴 5, 金板 3, 铁钉 10, 被净化的魔法石宝石 4, 被粉碎的黑金属 6, 噩梦守望者的遗物 2 
释放卷有效期解除卷轴 --> 毒药草 10, 纸张 5, 再生粉末 3, 扭曲粉末
困难模式赛尔高级魔族地下城 --> 不完整的赛尔地下城通行证, 复原秘药 2
困难模式伊比高级魔族地下城 --> 不完整的伊比地下城通行证, 复原秘药 3
困难模式伦达高级魔族地下城 --> 不完整的伦达地下城通行证, 复原秘药 5
梦幻拉比地下城通行证 --> 不完整的拉比地下城通行证, 复原秘药15
饼干篮子 --> 树枝 2, 廉价丝绸 2
梦幻拉比地下城镜像世界通行证 --> 不完整的拉比地下城通行证, 复原秘药 5 
银河系列钹 --> 旋律之金属板, 歌声之星星粉
银河系列短笛 --> 旋律之金属板 10, 歌声之星星粉
银河系列里拉琴 --> 协调之木板 10, 旋律之金属板 20, 技巧之弦 2
应援棒 --> 萤火虫的光 10
调音长笛 --> 调音工具, 长笛
调音短笛 --> 调音工具, 短笛
调音小提琴 --> 调音工具, 小提琴
调音大提琴 --> 调音工具, 大提琴
调音 银河系列长笛 --> 调音工具, 银河系列长笛
调音银河系列短笛 --> 调音工具, 银河系列短笛
调音 银河系列小提琴 --> 调音工具, 银河系列小提琴
调音 银河系列大提琴 --> 调音工具, 银河系列大提琴
高级香草熏香 --> 迷你香草熏香, 蜜蜡
高级薰衣草熏香 --> 迷你薰衣草熏香, 蜜蜡
高级柠檬香草熏香 --> 迷你柠檬香草熏香, 蜜蜡
高级樱桃熏香 --> 迷你樱桃熏香, 蜜蜡
高级棉花熏香 --> 迷你棉花熏香, 蜜蜡
最高级香草熏香 --> 高级香草熏香, 精炼催化剂
最高级薰衣草熏香 --> 高级薰衣草熏香, 精炼催化剂
最高级柠檬香草熏香 --> 高级柠檬香草熏香, 精炼催化剂
最高级樱桃熏香 --> 高级樱桃熏香, 精炼催化剂
最高级棉花熏香 --> 高级棉花熏香, 精炼催化剂
特殊的守护戒指 --> 戒指, 圣水, 再生粉末
特殊的保护链条 --> 米斯里线, 被遗忘的魔法师宝石';
    echo nl2br($text);
}

?>