<?php

$h2 = '装备改造';
$nav = '常用装备改造 | 所有改造';

function mainview() {
$text = <<<'TXT'
以下列举了常用装备改造，注意改造前的改造次数应是列举的次数-1。

<b>割喉链刃</b>（班格 艾顿）
1.磨刃片（大伤+5 小伤+5）
2.磨刀刃1（大伤+2 耐-1）
3.磨刀刃2（大伤+3 耐-2）
4.磨刀刃3（大伤+4 耐-3）
5.改造艾顿式（大伤+6 耐+4） | 铁匠改造（最高大伤+10）
6.宝石修理（钻石、翡翠、红宝石1cm 耐+3）

<b>凯尔特链刃</b>（班 艾顿）
1.磨刃片（大伤+5 小伤+5）
2.磨刀刃1（大伤+2 耐-1）
3.磨刀刃2（大伤+3 耐-2）
4.磨刀刃3（大伤+4 耐-3）
5.凯尔特链刃专属改造（大伤+21 耐+4 ...） | 铁匠改造（最高大伤+25）
6.宝石修理（钻石、翡翠、红宝石1cm 耐+3）

<b>凯尔特特拉伊魔杖/非凡的特拉伊魔杖</b>（希里安生态保护区 维埃撕）
1.凝聚自然力（魔攻+2）
2.自然力加速1（施展速度+3%）
3.自然力加速2（施展速度+4%）
4.三属性元素增幅4（魔法组合+4）
5.凝聚自然力4（魔攻+5）
6.特拉伊魔杖宝石改造1（淡蓝宝石、绿宝石、尖晶石3cm 魔攻+4）

<b>凯尔特德鲁伊法杖/原罪法杖</b>（生态 维埃撕）
1.凝聚自然力/自然力凝缩1（魔攻+2）
2.凝聚自然力/自然力凝缩2（魔攻+3）
3.凝聚自然力/自然力凝缩3（魔攻+5 耐-2）
4.凝聚自然力/自然力凝缩4（魔攻+6 耐-3）
5.凯尔特德鲁伊法杖专用改造（魔攻+7 魔耗-30% 耐-6） / 原罪法杖专属改造（魔攻+6 暴+15 耐-4）
6.宝石改造（淡蓝宝石、绿宝石、尖晶石3cm 魔攻+3 平衡+5）

<b>凯尔特皇室骑士之刃（凯单）</b>（敦巴伦 内莉斯）
1.凯尔特皇室骑士之刃专用改造（大伤+40 暴击+14 ...）
2.修整剑身2（大伤+2 ...）
3.修整剑身3（大伤+3 ...）
4.修整剑身4（大伤+4 ...）
5.铁匠改造（最高力量+30幸运+30） | 修整剑身5（大伤+5 ...）
6.宝石修理（钻石、红宝石、淡蓝宝石1cm 耐+2）

<b>黑龙猎杀者（黑龙弓）</b>（敦 内莉斯）
1.强化弓绳1（大伤+1 平衡-1）
2.更换瞄准器（大伤+3）
3.更换瞄准器（大伤+3）
4.强化弓绳4（大伤+4 平衡-4）
5.猎龙者封印解除（穿刺+1 大伤+12 小伤+1）
6.猎龙者宝石改造1（钻石、尖晶石、绿宝石5cm 大伤+2 暴+3）

<b>非凡的十字弓（非凡弩）/凯尔特皇室之弩</b>
1.强化尼克式弩（克拉营地 射程+200 大伤+5 暴-5 ...） 
2.强化弓弦2（敦铁匠铺内莉斯 大伤+1 小伤+2 ...）
3.强化弓弦3（敦铁匠铺内莉斯 大伤+1 小伤+3 ...）
4.福格斯式弩改造（大伤+3 小伤+3 暴+5 平衡+5）
5.老练的收尾（迪尔科内尔铁匠铺福格斯 穿刺+1）
6.弩宝石改造1（敦学校阿兰雯 石榴石1cm，淡蓝宝石2cm，绿宝石4cm）

<b>杏的手里剑/萩的手里剑/凯尔特手里剑</b>（迪尔科内尔 福格斯/班 艾顿）
1.打磨刀刃5（大伤+6 小伤+2 耐-2）
2.打磨刀刃1（大伤+1 耐+1）
3.打磨刀刃1（大伤+1 耐+1）
4.打磨刀刃4（大伤+6 暴-2 耐-1）
5.铁匠改造（最高杏大伤+31 萩大伤+18暴+7 凯尔特大伤+36）
6.手里剑宝石改造2（卡普港口铁匠铺凯纳 钻石、尖晶石、绿宝石3cm 小伤+2 耐+2）

<b>达乌拉SE/非凡的辛希尔雷特L2</b>（希尔文矿山 赫克托）
1.更换弹夹（子弹+8 耐-1） | 扩充火药容量（大伤+6 暴+4 耐-2）
2.增加膛线1（大伤+1）
3.增加膛线2（大伤+3 耐-1）
4.扩展枪身（射程+100 耐-1）
5.扩展枪身（射程+100 耐-1）
6.宝石改造1（钻石、尖晶石、绿宝石3cm 大伤+2 暴+2）

<b>凯尔特束缚操纵杆</b>（敦 内莉斯）
1.凯尔特操纵杆操控（大伤+26 暴-2 耐+3）
2.调整手柄1（大伤+2 小伤+2 平衡+2）
3.调整手柄2（大伤+3 小伤+2 平衡+3）
4.调整手柄3（大伤+4 小伤+2 平衡+4）
5.无限斩用：凯尔特操纵杆特殊改造（大伤+15 暴+3 耐-1） | 人偶用：铁匠改造（最高人偶大伤+30 人偶暴+6）
6.操纵杆宝石修理（尖晶石、翡翠1cm，淡蓝宝石2cm 耐+3）
TXT;
echo nl2br($text);
}

?>