<?php

/* 
 * by Snowy YANG
 * for http://snowy.asia/
 */

$title = '雪鸟幻梦之笼';

$text = <<<'TEXT'
<b>目录</b>
<b>日常篇 少女欲眠未眠</b>
<a href="#a00">0.雪鸟与风君的共同幻梦</a>
<a href="#a01">1.雪鸟的生活</a>
<a href="#a02">2.什么在影响梦境</a>
3.称谓很重要吗
4.今天吃什么 今天梦什么
5.在超市里看见了新商品 怎样才能让他知道呢
6.衣柜够大吗 我在梦里要是什么样子的
7.现实和梦境哪个比较重要
8.多久没有梦见对方了
9.禁断症 沉迷式 重逢时
10.幻想力
11.重复的日夜
12.雪鸟幻想中风君的世界与生活
99.二分世界 一梦之笼
<b>非日常篇 - 混乱场</b>
他们在平淡的联系生活中遇到了可怕的敌人
<b>日常篇 - 搜寻风的痕迹</b>
雪鸟企图在现实世界中抓到风君的日子
<b>非日常篇 - 大正8年8月的东京百合花</b>
DLC内容 这儿只开个头

<b id="a00">0.雪鸟与风君的共同幻梦</b>
梦里经常下雪 梦里经常飞行 所以自称自己是雪鸟
现实中使用的姓名 我觉得并不重要
他是我在梦中经常见到的一个男性
似乎比我大一两岁的样子
有一次梦里问他的名字 他回答我是风
一个字的名字太单调了 所以我在末尾加上了君字作为称呼
12岁那年 我第一次梦见了他
梦里我一个人走入了家附近的小山
在山间湖边见到了一个小屋子
我站在窗口 看见他在屋子里弹着钢琴
我听着钢琴的声音发呆
然后梦就醒了
在那之后十几年 几乎每天都能梦见他
不过有一年发生了可怕的事 在那之后我们没法保持每天的梦会了
即使如此 他也没有完全消失
上次梦见山风的日子 就在上周
曾经也想过要在现实中见到山风 并为此而努力了很久
很可惜努力之后了解到 他不在我所生活的世界 我没有办法见到他
虽然不是现实 梦境也影响着我的人生
欢迎开启雪鸟幻梦之笼

<b id="a01">1.雪鸟的生活</b>
每天8点出门 每天18点到家 这是工作日的基调
9点的时候到写字楼 12点去便利店吃饭 13点返回写字楼 17点再离开
回到家打开游戏 玩了一整晚 到了0点就关了电脑睡觉
这样的生活 从学校毕业以来 已经过了几百天
工作的内容没有多少变化 便利店的伙食只有那么几种选择 游戏的内容几个季度更新一次
如果到了休息日 就玩上一整天的游戏
至于外出什么的 周围几个省份的城市都跑过 每个城市都是一排又一排的建筑 和来来往往的行人
偶尔去了一趟郊区 看过山水花鸟 感受过不同的气候温度 也只是细节的差别
我对这样的生活没有意外 认识的同龄人也大多过着这样的生活 活在人世间大概就是这样的吧
不过睡觉的时候 却能给我另一份体会
梦境
梦境变化无常 有着各种各样不同的气氛 有时觉得很温馨 有时觉得很古怪 有时能感到恐惧
看见过黑暗的山峦 也见过绮丽的草原 从未在世间见过的精灵 还有奇妙的声音
也许我在梦里意识穿行到了其他境界？
我不知道 现实生活多多少少有点重复和无聊 梦境却给了我并不单一的体验
还有就是 我每过一段时间 总能在梦里见到风君
每次见到他我都很高兴 我们可以说上各种各样的话题 偶尔能听到他演奏的音乐
现在想起来 我们已经认识十几年了 他从未离开过 我真的是觉得无比幸运

<b id="a02">2.什么在影响梦境</b>
梦见什么 总不是自己能决定的
有的时候心情很好 却会梦见可怕的事物
有的时候对风君思念至极 就是梦不见他
科学没有一致的说法 我曾经自己记录每一天的梦境 企图寻找规律
不过最终只能得出一个结论 梦境不是完全由我的意识做主的
学生时代可以午休 晚上的梦感觉比中午的梦更真实 我总希望可以晚上见到风君
不过风君大多在中午出现 有时才会在晚上出现
我在梦里想什么 似乎可以传达给风君 倒不如说 可以用意识对话
我可以听见 可以看见 可以有触觉 也可以感受到风君的想法
所以我那时就觉得 梦境大约是一种交流方式
最初我觉得他也是一个人 也在做梦
在我22岁的时候 也就是和他认识10年之后 我生了一场很重的病
在病中我有了这样的想法 风君不是人类
他是山上的妖灵 12岁第一次梦见他的那天下午 我是去了山上玩的
他在山上见到了我 之后才在梦中和我见面的
梦 也许是一种暗物质 或者暗能量吧
他和我都可以影响我的梦境 谁的主观意识更为强烈 梦境更能反应出谁的想法
我没有什么想法 只是单纯的想见到他 所以梦里我们经常在闲聊
也许 我内心深处的灵魂 更像一只飞鸟 而他居住在山里 所以我梦里经常在山中飞行
山上的氛围是那样安逸 飞行的感觉让我恋恋不舍 相比之下 每天通勤的现实生活真是枯燥
风 请把我带到另一个境界  
TEXT;

function view() {
?>
<style>
p {
	line-height:1.5
}
</style>
<h1>雪鸟幻梦之笼</h1>
<?php
	global $text;
	$timestamp = date('Y年n月j日H:i:s', filemtime(__FILE__));
	echo "<p>（更新中...最后编辑于${timestamp}）<br><br>";
	$lines = explode("\n",$text);
	foreach($lines as $l) {
		echo $l;
		echo '<br>';
	}
	echo "<br>（未完待续...最后编辑于${timestamp}）</p>";
}
