<?php

/* 
 * by Snowy YANG
 * for http://snowy.asia/
 */

$title = '雪鸟幻梦之笼';


function view() {
global $title;
$text = <<<'TEXT'
<b>未完结时的前言</b>
定下雪鸟这个游戏 我开始写这篇小说 然后三次删掉了写好的几千字开始重写
现在的这个状态 我也不敢保证会不会有一天又全部砍掉重写 之前写的内容可以在GitHub翻到
只能说写一步是一步 也许写着写着真的写完了呢 等到真的写完了我就会开始做游戏啦

<b>目录</b>
<a href="#a0">0. 我知道这是梦</a>
<a href="#a1">1. 最初在梦里听见的音色</a>
<a href="#a2">2. 执着的雪 随意的风</a>
<a href="#a3">3. 混乱场</a>
<a href="#a4">4. 凝想力</a>
<a href="#a5">5. 遥遥十年 近在咫尺</a>
<a href="#a6">6. 风止雾浓之时</a>
<a href="#a7">7. 雪的选择</a>
<a href="#a8">8. 雪鸟幻梦之笼</a>

<b id="a0">0.我知道这是梦</b>
淡淡的光线斜入我的卧室，一种流通感从身体深处传来，我知道这是梦。
带着这样感觉的梦，我已经经历过十年了。
那个人又躲在什么高深的地方吧？
随着这样的感想，我径直走出窗户，在梦境中飞行起来。
其实，倒不如说是梦境引导着我进入下一个场景。
看着街道在身下移动，楼房在两边擦过，我不敢留意太多的细节。
观察梦中的景物，会消耗梦境，简单地说，观察的细节越多，梦就越容易醒来。
闭上眼睛什么都不看的话，梦境会非常缓慢的流逝，伴随着一阵阵的流通感。
我知道这份流通感的源头，那个人，名字的话，似乎是“风”，称呼的时候加上君字，风君。
终于，街道有了尽头，我看到了田野。
我想我接近风君一些了。
最初在梦里经历鸟瞰图都有一种晕眩感，现在已经完全习惯了，再加上梦里经常下雪，所以我才自称雪鸟啊。
这一次的田野并没有被积雪覆盖呢。
我在远方看见了山峦，这一次，梦境的变化也是平常的节奏。
我在山脚停了下来，周围是茂密的竹林，抬头能看见明晃晃的月亮。
仔细想想，最初进入这个梦境的时候，好像还是白天的光线，突然就到了夜晚了。
不过梦境就是变幻莫测才是梦境。
这次不允许我飞行了嘛……
我想快点见到风君，所以没有走山路，而是直接进入竹林。
正如同我所预料的，不常规的操作打破了梦境的进度，竹林瞬间消失了，他站在那里。
我看到他的第一句话，是一直在我心里想的那句——
“我们可以在现实中见面了吧。”

<b id="a1">1. 最初在梦里听见的音色</b>
最初是在十二岁的时候。
深夜，我慢慢地走在山路上。
这座山在我家附近，我很熟悉。
但这次，山路却有了一种变化。
我遭遇到了屏障一般的建筑，古式的围墙和拱门。
我感觉我一直在前进，但结果却是循环往复。
于是我专注了要继续前进的决心，这次终于走出去了。
天亮了，清晨的光线渲染下，我看见了莹亮的湖水。
走向湖水，发现旁边有一个非常简陋的小房子。
温柔的琴声传过来，我站在窗口，看见一个男生的背影。
然后我醒来了，发现是梦。

在那之后，我几乎每天都能梦见那个男生。
在那个小房子角落，有个茶几，我们一般挨着茶几席地而坐。
有一两次，他也在弹琴，但是即使用心记下的音乐在醒来时也会忘记。
久而久之，我熟悉了梦见他的时候的感觉，流通感。
仿佛有什么气息慢慢平缓的流入了身体，相应的，也有我自己的气息流出。
这是有关他的梦境和一般梦境不同的地方。

梦里和他的聊天话题总是很简单。
因为复杂的思维无法带入梦境，无论我在醒着的时候多么活跃，在梦里也只能呆呆的。
觉得自己就想个洋娃娃坐在那里听他对我说话，虽然一般他不会和我说太复杂的事物。
只是季节的冷暖，他的心情，他对我白天做的一些事的想法。
我还是能回复“嗯”“哎？”“这样啊……”
想要补充说明自己的想法需要巨大的决心，而这份决心会消耗梦境，有时就会突然醒来。
更多的时候他也没说什么特别的，只是看着我，也许说的太多对他来说也会消耗梦境吧。
我从这种光景中能同时感觉到一种特别的温暖和阴冷。
总是希望梦可以维持得久一点，梦也真的越做越久。
渐渐的我适应了有他的梦境，渐渐的我开始期待有他的梦境，渐渐的我开始沉迷在梦境中。
理由也没什么，也许因为我不喜欢中学的生活，总想着逃避父母、老师和同学，梦境成为避难所。
……还是因为潜意识里，存在着什么我没有意识到的事物呢？

<b id="a2">2. 执着的雪 随意的风</b>
十四岁的时候产生了在现实中见面的想法。
第一次，下了巨大的决心，消耗了10分钟的梦境，直白的和他说了这个想法。
既没有同意，也没有拒绝，梦境只是持续着，我还能感觉到他，但他没说话。
小屋里的环境切换成了山景，我不敢过目太多细节，只是能感觉到山的气息。
他站起来，牵着我的手，带着我在山上走了几步。
然后我醒来了。

第二次，问他叫什么名字。
然后看见面前一张宣纸上写着一个字，颯，然而听到的读音，却是介于颾的两个读音之间。
我非常仔细非常认真的看清了那个字，梦境自然也被消耗完毕，我醒了过来，接下来，就开始搜这个字了。
当时的同龄人们都在用人人和QQ空间，我动用内部搜索功能和外部搜索引擎，所有和飒有关的都搜了出来。
但是搜索结果很少，只有极少数人用这个做昵称，而人人上叫这个名字的只有一个女生。
然后我就开始关注日志里提到这个字或者网游之类的叫这个名字的，翻了几百页，也没找到看起来像的。
于是我想，字虽然没有看错，但是读音是颾，会不会是其他相关的文字。
再进一步的搜索这个飒字，我才了解到我梦里听到的是这个字的日文读音。
难道是日本人吗？不过他会说中文。
于是我用了Google，搜到了很多和飒相关的人名，这样一来，又要大海捞针了。

在那之后，我就尝试问他居住在哪。
他又一次将梦境从小屋切换到山景，这次我不再担心梦境的消耗，用尽决心看清楚了。
我发现这座山上香樟树之类的植被其实非常像我家附近的那座山，但没有完全一样的景色。
不自觉的，开始落雪了，我突然将双手张开，把它们当作翅膀让自己飞起来了。
就这样，我开始在雪花树木间穿梭，鸟瞰图的画面让我心跳不已，第一次以这种真切动态的俯视看降雪的山林。
飞远了，我突然担心起他在哪里，就这样场景切换又切到了小屋，看见他在我面前，安心了下来，梦醒来。
这次梦中飞行给了我后脑一定的震动感，我莫名兴奋，后来的很多梦都开始飞行。

虽然他从没告诉过我具体的信息，但我从没放弃搜索引擎。
在那之后我开始学日语，进入二次元圈。
我在网络上很高调，经常去各种贴吧论坛频繁发言，几乎看到什么帖子都会回几个字。
出了新网游，也会问问他玩不玩，没有得到肯定答复，省了不少心。
而我用的网名，只要有可能，都是“风”“雪”“山”“鸟”类似的文字组合。
总想着他也是一个和我一样的人，他也做着和我相同的梦。
平时也会经常翻与梦有关的日记、帖子、小说，想尽一切他可能做的事企图找到蛛丝马迹。
这样一做，就是八年，直到我二十二岁的时候，发生了一件痛苦的事。

<b id="a3">3. 混乱场</b>
那一年大三，玩游戏认识了一个人，深夜闲聊。
他大约说他身体不好之类的，曾经还有脑出血。于是我也和他说了我经常做梦梦见一个男生的事。
从那天开始，我就经常会梦见非常阴暗的场景和事物，破旧的教堂，角落结成的蜘蛛网，密不透光的森林。
一开始还没有特别的感觉，渐渐的脑子越来越痛，学校附近有一个小风景区，我不得不经常去那里散步，去过之后脑子疼痛感会好一点。
阴暗的梦越来越多，一旦睡着就会梦见，难以苏醒，我的记忆开始出现错误，也没有办法去上课了。
很奇怪，当时我并没有想到去医院，也许以当时我的大脑的状况，根本无法产生“去医院”这种想法。
最终我的辅导员知道了情况，让我去做了心理咨询。
我告诉了心理咨询的大姐姐我小时候的事，十年以来的事，还有最近的事。
她沉默了很久，我读不懂她的表情。
然后她只是问一直以来的梦给了我什么样的感受。
我说，除了最近这种，一直以来我都很喜欢那样的梦境。
她突然问我是否恋爱，我说没有。
她说不恋爱你的大学生活是不完整的。
我觉得不完整一说很荒谬，但没有反驳她，只说自己想专注学业为毕业后做准备。
她说那样也可以，就结束了这次心理咨询。

<b id="a4">4. 凝想力</b>
在那之后我奇迹般的睡好了，并且陷入了某种复杂的悲伤与欣慰。
可能是在某个物理时间的间隙之中发生了什么（就好像《来自星星的你》男二表白前男主的时间回溯），我的心境发生了某种变化。
我的大脑很空，那一学期缺席了所有选修课考试，好在我的学分是足够的。
很久以前，他是个小小的官吏，我们是青梅竹马，父母介绍了我们的婚姻。
我不知道那是不是第一次结婚。
后来转入亡灵生活的冥界，我们仍然在一起，那个时候是做阴司。
可能他比较擅长文案，一直都是这样的文职类工作。
这样的表述有点不准确，那个很久以前我还没有出生，也许，就是传说中我们的前世吧。
但是这一生我可能见不到他了。
好像是还是胎儿的时候就被查出来了什么病，以死亡的方式降临到了这个世界。
不知道是哪户人家呢，可能是我家附近的吧，也许他要是没有病的话，我们还会是青梅竹马之类的。
于是他的灵魂就那样寄居在山里了，因为时间未到，或者是他自己不希望，还不能转入冥界。
飒，是山中的其他生灵对他的称呼。
我爬山的那次他看到了我，然后，就这样一直让我梦见他。
但是，现在开始不行了。
那位网友是被恶灵盯上的，恶灵顺着我和那位网友的交集找上了我。
因为一直以来做梦，大脑都保持在较为通灵的频道，很容易受到恶灵干扰。
现在学校做了什么，我可以保持一定时间的安稳，但是大脑必须离开通灵的频道了，否则还会做那些噩梦。
何况就算没有恶灵，一直做梦对我身体也可能产生不太好的影响。
就这样想到了这么多，就这样突然引入了很多很多奇奇怪怪的概念，勉勉强强自圆其说了自己的经历。

<b id="a5">5. 遥遥十年 近在咫尺</b>
暑假的时候返回家中，我又来到了那座山前。
想一想他就住在那里，虽然我看不见。
多少年来我一直在做着关于他的梦，但是现在没有了。
回想十年以来的经历，从一开始就沉迷梦境，再陷入，我想是，陷入恋爱，再遭遇疾病，再突然想到了曾经久远的故事。
我啊，大约是不会恋爱了。
我不知道什么是喜欢，我也不知道我喜欢他哪里，但我知道，我肯定不会喜欢别的男生。
人，其实都挺相似的，然而差别也可以很大，但是无论是对相似还是对不同我都不感兴趣，我只是沉迷在以往日复一日的相处之中。
甚至在我潜意识里，在我灵魂深处，更为久远的长期的相处之中，也许细节我都不记得了，但我沉迷那种感觉，沉迷他给我的气息。
这大约对我而言就是喜欢，就是恋爱。
十年以来我找了这么久，他却居然在离我这么近的地方，我竟是一直都没有发现。
但是，我看不见他，摸不到他，甚至，现在，为了更为健康的身体，也没法做梦了。

<b id="a6">6. 风止雾浓之时</b>
读硕那段时间，可能是我最抑郁的时间。
长期以来，每一天都是，睡很久很久。
也许我企图在梦里找他，但其实不是，我根本没有兴趣起来，所以能翘的课都翘了，没有任何科目是A，每天什么都不做，就只是睡觉。
曾经为了找他而活跃的网络我也不再活跃，连看别人发帖的兴趣都没有，每天可以说除了睡觉也没什么其他事可做。
也许有点伤心，但也并不伤心，只是自己真的没有办法再激励自己，每天呆呆的望着窗外几分钟，心中空无一物，吃完了饭，又爬上了床。
但我还在好好吃饭，勉强应付着研究生的课程，这一切的理由，我想我是并没有放弃人生。
只是我找不到任何理由来更好的面对生活，我似乎是为了活着而活着，因为我知道选择死亡是一种错误，我不想犯错所以活了下来。
这样的思维非常可怕，我想我是得抑郁症了。
所以我想去就医，但我发现我有点害怕，我不知道如何开口自己的理由，我害怕医生也像那位心理咨询的姐姐一样建议我恋爱结婚。
所以就没有去就医，我试着按照网上查到的说法吃了一些樱桃、三文鱼，不过并没有什么效果。
偶尔也看一些激励的书，有一些书是有一点效果的，我看过之后没有那么想睡觉了，但是维持不了太久。
这样过去了三年，快毕业了，我告诉自己该找工作了，但是简历迟迟没有写。
直到有一天，我在看一些历史书之后，做了一个梦。
梦中的我们穿着民国时期的衣服，他这样和我说。
“你想我已经想了很多了，
但和我在一起生活并不是活在这个世上的唯一理由，
你知道这个世界的资源就连空气都没有真正平均分配给每一个人，
为了给自己所在意的人们争取资源，甚至为了不被其他人伤害，为此而付出许多努力，也是活着的理由，
你要知道这个世界仍然美好，我们不能选择放弃。”
醒来的时候，我流泪了，我想到了一战二战时期国内与世界上发生的很多事情。
那些与他无关的事，因为太过于惨烈，我还是没法冷漠。
然后我就开始写简历，好好的找工作了。

<b id="a7">7. 雪的选择</b>
工作后，父母开始给我介绍男友。
我都表示了拒绝，但有一天，有一个人加我QQ好友。
因为我同时在网上做些小买卖，所以几乎所有人我都通过了好友请求，结果是一个男生说父母介绍来的能不能见一见。
我当即表示了拒绝，他问及理由，我如实回答了。
他说，他现在只是作为一个外人来给出评论。
他并不知道我的想法是不是“正确”，但是否正确也许并不重要。
无论是梦境，还是前世，我都不一定需要这么执着。
我说我知道的，但我选择这一生守护与他的恋爱，哪怕父母会不高兴，哪怕旁人会不理解。
他留下了一般式的祝福话语，没有再多说其他。

<b id="a8">8. 雪鸟幻梦之笼</b>
因为无论和父母怎么说他们都不理解，我之后也就基本不再主动联系他们。
另一方面我开始专注实现财务自由。
除了全职工作，还在游戏里、淘宝上以及各种渠道做小买卖，支付宝开通了商家，每次进账都让我十分激动。
我想，这盯着数钱，也许对我来说就是“活着”的感受。
不过有的时候，我还是会想起那些梦，还有梦里的风君。
但是不再期望做梦了，我的生活已经足够充实，不需要再逃避到梦中。
不过也许，我是说也许，也许有的时候，我还会再做梦梦见他的，我是这么想的，有这种可能性。
我想我一定不会拒绝梦见他的。
网上的同好知道我不结婚的理由，说我简直就像笼中鸟一样。
她没有说错，我就一直生活在笼中，等待与自己的主人来世重逢。
TEXT;
$timestamp = date('Y年n月j日H:i:s', filemtime(__FILE__));
echo "<h1>$title</h1><p style=\"max-width:50em\">（更新中...最后编辑于${timestamp}）<br><br>";
$lines = explode("\n",$text);
foreach($lines as $l) {
	echo $l;
	echo '<br>';
}
echo "<br>（未完待续...最后编辑于${timestamp}）</p>";
}
