<?php
$title = '幻梦情劫';

function view() {
?>
<h2>幻梦情劫</h2>
<p>我12岁的时候，家在一座小山边。<br>
有一天我一个人去山里玩，晚上回家做了一个梦。<br>
梦里看不见画面，但我能感觉到。<br>
有一个男生来到我身边，抚摸着我的手。<br>
无声的气息在我们之间流动，我知道这是梦。<br>
我并不反感，只是感受着他的抚摸。<br>
然后我感觉到他要走了。<br>
我不是对他说，而是自己在心里思考，叫他不要走。<br>
他似乎是知道了我心里的想法，又待了一会儿。<br>
也许是10分钟，也许是20分钟，最终我还是醒了过来。</p>

<p>之后几乎每一天，我都能梦见他。<br>
我们在梦里并没有太多话语，更多的都是行动和意念。<br>
在城市的上空手拉手飞行。<br>
在花园迷宫中玩耍。<br>
在怪异的街道上散步。<br>
在池塘里抓鲤鱼。<br>
有的时候我在学校里遇到了烦恼，他什么也不说，只是梳着我的头发。<br>
有什么想对他说的就在自己心里想一遍，我的心里也会突然出现他传来的想法。<br>
我很自然地跟随他一起行动，似乎内心就认可了什么一样。</p>

<p>14岁的时候，我对他表白。<br>
也许是因为他每天都在梦里陪我，我才会喜欢他。<br>
那个时候我看《Fate Stay/Night》，所以称呼他为主人。<br>
我幻想着自己是他的Servant，能通过他增强自己的魔法力量。<br>
小学的时候看《魔卡少女樱》，我可是一直梦想成为魔法少女。</p>

<p>15岁的时候，我在网上搜索到，这是睡眠瘫痪症。<br>
但我却觉得，对方也是个男生，和我做着共通的梦。<br>
我非常想在现实中找到他。</p>

<p>我开始写梦见他的日记，在网上搜索。<br>
我尝试问他的名字，但没有得到答案。<br>
我发现我也很难告诉他自己的名字，毕竟我的名字读音非常常见，我在内心想的时候似乎也只是重复了一下名字的发音。<br>
梦里偶尔有能看见他的样子，不是从我的视角，是从第三方的视角。<br>
我自己在梦里的样子和我现实中差别很大。<br>
学业繁忙，我只是重复着日复一日白天上学晚上做梦的生活。<br>
也没有思考太多。</p>

<p>16岁的时候，我们在梦里做了恋人才会做的事。<br>
身体的那个部位第一次感受到了触觉。<br>
之后，大概每两个月我都会有和他的春梦。</p>

<p>18岁的时候，要准备填志愿了。<br>
我该去哪里的大学才能见到他呢？<br>
我在梦里咨询他的意见。<br>
然后我似乎得到了一个答案：香港。</p>

<p>但是最终的考试结果没能让我去香港。<br>
我被北京的大学录取。<br>
入学的第一周，我就在梦里被告知他没法来北京。<br>
所以我在大学绝不会恋爱。<br>
我还等着到香港找他。</p>

<p>大学里，我也一样经常梦见他。<br>
我们在梦里逛图书馆看书。<br>
在梦里一起野餐。<br>
在梦里一起思考如何去香港。</p>

<p>本来一切应该平淡而温馨。<br>
但是22岁的时候发生了意想不到的事。<br>
我连续一个月每天做噩梦梦见夕阳下坠，之后一位网友因病去世。<br>
我因此得了躁郁症，有了许多妄想。<br>
自己前世深爱的未婚夫在乱世中死亡，自己落难被人救到日本。<br>
我一直梦见的他是我前世未婚夫的转世。<br>
但他不是人类，是妖，我在现实中是看不见他的。<br>
我的灵魂诞生地是香港，而他住在我家附近的那座山上。<br>
我小时候去山上玩他看见我的，之后就一直让我梦见他。</p>

<p>放假我回到故乡，又去了那座山。<br>
想到他就一直在离我这么近的地方，我却没有发现。<br>
真希望自己可以做一辈子梦。<br>
但是不知道为什么，我梦见他的次数越来越少。</p>

<p>一开始我还能岁月安好不去多想，或者猜测他不想做梦加重我躁郁症。<br>
后来发展到连续几个月都不能梦见他，我陷入一种无法控制的烦躁与乱想中。<br>
他为什么不来看我呢？<br>
更重要的是，我无法接受自己单身，一个人实在太难受了。<br>
我是个完全的恋爱脑，失去了恋爱就仿佛失去了人生的意义。<br>
但我心底始终保持着一种不会改变的妄想，他并非不要我了，也不是有了别人。</p>

<p>然后过了好久好久，可能是五年吧。<br>
我又可以每天梦见他了。<br>
这五年来联系不上，确实是有着客观的原因。<br>
这个原因现在依然障碍着我们，我现在梦见他的时间点有非常严格的限制。<br>
我研究了很多玄学，也妄想了各种可能性。<br>
就结论而言，我和他还不够强。<br>
虽然恋爱并非强者的特权，但变强才更容易自由恋爱。<br>
但愿有办法回到我们自由做梦恋爱的小时候吧。<br>
如今每一天，我还是那样期待在梦里见到他。<br>
我想我这一生不会现实中和其他男性结婚的。<br>
做梦对我来说就是幸福。</p>

<p>Snowy<br>
2022年11月</p>
<?php } ?>
