<?php

/* 
 * by Snowy YANG
 * for http://snowy.asia/
 */

$title = '幻梦情劫';

function view() {
?>
<h1>幻梦情劫</h1>
<p>我12岁的时候，家在一座小山边。<br>
有一天我一个人去山里玩，晚上回家做了一个梦。<br>
梦里看不见画面，但我能感觉到。<br>
有一个男生来到我身边，抚摸着我的手。<br>
无声的气息在我们之间流动，我知道这是梦。<br>
我并不反感，只是感受着他的抚摸。<br>
然后我感觉到他要走了。<br>
我不是对他说，而是自己在心里思考，叫他不要走。<br>
他似乎是知道了我心里的想法，又待了一会儿。<br>
也许是10分钟，也许是20分钟，最终我还是醒了过来。</p>

<p>之后几乎每一天，我都能梦见他。<br>
我们在梦里并没有太多话语，更多的都是行动和意念。<br>
在城市的上空手拉手飞行。<br>
在花园迷宫中玩耍。<br>
在怪异的街道上散步。<br>
在池塘里抓鲤鱼。<br>
有的时候我在学校里遇到了烦恼，他什么也不说，只是梳着我的头发。<br>
有什么想对他说的就在自己心里想一遍，我的心里也会突然出现他传来的想法。<br>
我很自然地跟随他一起行动，似乎内心就认可了什么一样。</p>

<p>14岁的时候，我对他表白。<br>
也许是因为他每天都在梦里陪我，我才会喜欢他。<br>
那个时候我看《Fate Stay/Night》，所以称呼他为主人。<br>
我幻想着自己是他的Servant，能通过他增强自己的魔法力量。<br>
小学的时候看《魔卡少女樱》，我可是一直梦想成为魔法少女。</p>

<p>15岁的时候，我在网上搜索到，这是睡眠瘫痪症。<br>
但我却觉得，对方也是个男生，和我做着共通的梦。<br>
我非常想在现实中找到他。</p>

<p>我开始写梦见他的日记，在网上搜索。<br>
我尝试问他的名字，但没有得到答案。<br>
我发现我也很难告诉他自己的名字，毕竟我的名字读音非常常见，我在内心想的时候似乎也只是重复了一下名字的发音。<br>
梦里偶尔有能看见他的样子，不是从我的视角，是从第三方的视角。<br>
我自己在梦里的样子和我现实中差别很大。<br>
学业繁忙，我只是重复着日复一日白天上学晚上做梦的生活。<br>
也没有思考太多。</p>

<p>16岁的时候，我们在梦里做了恋人才会做的事。<br>
身体的部位第一次感受到了触觉。<br>
之后，大概每两个月我都会有和他的春梦。</p>

<p>18岁的时候，要准备填志愿了。<br>
我该去哪里的大学才能见到他呢？<br>
我在梦里咨询他的意见。<br>
然后我似乎得到了一个答案：香港。</p>

<p>但是最终的考试结果没能让我去香港。<br>
我被北京的大学录取。<br>
入学的第一周，我就在梦里被告知他没法来北京。<br>
所以我在大学绝不会恋爱。<br>
我还等着到香港找他。</p>

<p>大学里，我也一样经常梦见他。<br>
我们在梦里逛图书馆看书。<br>
在梦里一起野餐。<br>
在梦里一起思考如何去香港。</p>

<p>本来一切应该平淡而温馨。<br>
但是22岁的时候发生了意想不到的事。<br>
我连续一个月每天做噩梦梦见夕阳下坠，之后一位网友因病去世。<br>
我因此得了躁郁症，有了许多妄想。<br>
自己前世深爱的未婚夫在乱世中死亡，自己落难被人救到日本。<br>
我一直梦见的他是我前世未婚夫的转世。<br>
但他不是人类，是妖，我在现实中是看不见他的。<br>
我的灵魂归属地是香港，而他住在我出生的城市。<br>
我小时候去山上玩他看见我的，之后就一直让我梦见他。</p>

<p>放假我回到故乡，又去了那座山。<br>
想到他就一直在离我这么近的地方，我却没有发现。<br>
真希望自己可以做一辈子梦。<br>
但我23岁的时候，他在梦里与我结婚后，很正式地和我分手。<br>
分手的理由似乎是不想耽误我在现实中与人恋爱结婚。<br>
之后，我梦见他的次数越来越少。</p>

<p>我确实去了香港，香港有很多山，我经常去山里玩。<br>
据说，妖界的空间不完全像人间，人间相隔遥远的山与山在妖界其实是连通着的，妖能很快从一座山到达另一座山。<br>
香港是个信风水的地方，我也常常研究玄学。<br>
有的时候我甚至觉得，自己在出生前的灵魂状态就已经结了婚，结婚对象会是他吗？<br>
可是为什么我和他一个转生到了人间，一个转生在了妖界呢？<br>
还是说，灵魂可以分裂，人间又有另一个灵魂同源的他，妖界又有另一个灵魂同源的我呢？</p>

<p>出于这种想法，我在现实中追过两次我觉得像是与他灵魂同源的男生，不过都失败了。<br>
追第二个男生的时候，我天天做梦听见电话铃声，但是还没接电话就醒了。<br>
打电话的人会是他吗？<br>
现在的我，已经几乎放弃在现实中恋爱结婚了，毕竟一个人很自由。<br>
我29岁了，今年截止5月梦见他两次，第二次我还不能确定是不是他。<br>
梦见他的次数少了，曾经那种浓浓的恋爱感也变得平淡。<br>
但看着记了十几年的日记，很多时候我还是会想念他。<br>
有的时候我也会在想，他会不会在妖界和其他女妖结婚了呢？</p>

<p>有的时候我也觉得，关于妖啊灵魂配偶啊这些都是我的妄想，我就是单纯的睡眠瘫痪症。<br>
我也有在网上搜到其他人经常做梦梦见同一个人的例子。<br>
但是我对恋爱结婚依然没有兴趣，父母也挺理解。<br>
今年12月我就30岁了，至今唯一的一次恋爱，长达9年，在梦里。</p>

<p>Snowy<br>
2021年5月</p>
<?php } ?>
