<?php

/* 
 * by Snowy YANG
 * for http://snowy.asia/
 */

$title = '通灵夜记';


function view() {
global $title;
$text = <<<'TEXT'
有些故事会比较晦暗甚至让人难受，所以17+。
更新会很慢很慢，这是个不会完结的短篇故事集，除叙述世界观的0篇系列外，倒序排列。

<b>0.笔者与黑白冥都的蓝色阴司</b>
&emsp;&emsp;人类与动物正常死亡后，灵魂会带着死亡气息降至死亡世界，即冥界。冥界充满了死亡气息，所以大部分事物看着都是黑白灰色的，死亡的气息隔绝了大部分的色彩。
&emsp;&emsp;但是我被称为冥都之蓝，因为我的属性是水，并且是极强的水，水的蓝色气息穿透了环境的死亡气息，所以别人看到我能感受到蓝色，他们就给我起了冥都之蓝的绰号。
&emsp;&emsp;他们是我的同事，我们是阴司，其实就是一天到晚呼吸着死亡气息，引导着各个降来冥界的灵魂脱去死亡气息去往其他世界，大部分都是魂归故里与自己的没有转生的那一部分灵魂合并，在中国最大的仙界等待下次转生。
&emsp;&emsp;我的工作是去处理非正常死亡的灵魂，如同不法之人偷猎野生动物，邪恶的鬼怪也会暗算柔弱的人类，将人类置于死地后再侵害灵魂，所以我经常要去人界，乃至仙界鬼界处理纠纷。当然我在人界人类的肉眼是看不到我的，正如同他们看不见鬼怪一样。
&emsp;&emsp;当然笔者不是冥魂阴司，笔者是一个与我灵魂同源思维共通的人类，也就是二十多年前我的灵魂分出了一部分在人界出生为了笔者，笔者死亡后不出意外灵魂会与我合并。通灵的原因是我的水属性过于强烈，这个属性不仅能穿透死亡气息，还能穿透时空，能知道别的世界发生的事，能预知未来。以我的经历为灵感，笔者写下这本通灵夜记。

<b>1.一般区域性连续死亡事件</b>
&emsp;&emsp;这种情况是比较常见的，常在农村，一个地方死了人，之后又有人在那个地方死亡，不过几年前北京地铁竟然也发生了一个月死一个人的事情，持续了半年多（是2014年到2015年吧？记得那时经常看见新闻，说是跳轨，其实多半是晕倒跌进去的）。其实对世间的鬼怪来说，人类的灵魂是一种“资源”，就像蚊子和拥有鲜血的动物一样。意外死亡的灵魂被当地的鬼怪扣住，没法回归冥界，受尽折磨，而中国鬼怪开出的条件就是让这个灵魂去制造下一个受害者。其实把人类的灵魂整个分了吃掉也是可以的，但因为这样需要消耗大量的战斗力，因为灵魂是非常坚韧不容易被完全毁灭的，虽然对它们来说让这个灵魂成为它们的共犯去残害下一个活人比较好。
&emsp;&emsp;鬼怪能对活人产生什么影响呢？一般身心健康的人类不容易被鬼怪影响，但处于极端情绪比如恐惧紧张之类的就很容易被影响。强烈的一点的比如制造幻象，那是对精神不稳定的人才有效，诱发癌症白血病似乎也行的，我曾强烈怀疑牵尸要价摄影的作者就是被诅咒得癌症的，激发嫉妒仇恨生气等负面情绪是最常见的，对大部分人都有效，比如有的夫妻婆媳父母子女就喜欢一天到晚吵架乃至发生悲剧，其实他们吵架在别人看来几乎毫无理由。机械故障也可以引发，我曾有段时间手机就是经常不能上网，信号不好大约说不过去。特别厉害的可以让飞机坠毁，这个确实属于很厉害的了，一般是办不到的。不过2015年的德国之翼坠机事件，利用的不是机械故障了，虽然官方结论说飞行员抑郁症想自杀，但那其实是患有抑郁症的飞行员的精神被鬼怪控制了。不过说了这么多可怕的例子，不要觉得鬼怪很可怕，毕竟鬼怪是灵魂体，人类也有灵魂的，肉体是更容易被自己的灵魂控制的，而且之前也说了灵魂是比较坚韧的，所以癌症也不是说被诅咒就会患上，至于机械故障，机械本身也有不容易被打破的物理条理（物理是种条理规则）来维护，这个条理规则要有极端的灵魂力才会有非常细微的影响，当然具体的公式笔者是没法给出的，不过我知道维护物理规则的力量是维护光速的力量，光速是绝对稳定精确的，事实上，是光速定义了物理空间米和时间单位秒之间的数值比（具体看维基）。
&emsp;&emsp;回归题目，解决连续死亡事件的唯一方法就是打，民众的灵魂多半比较软弱（个人认为这是中国仙界单一道德准入条件忽视能力，导致大部分仙界居民追求不求有功但求无过而不修炼灵魂战斗力），被折磨着折磨着就真的成了共犯去害下一个人了，所以只能派人去打，战胜鬼怪把被扣的灵魂放回原界，说教什么的我是不觉得有什么用的。且不说灵魂，就算是活人，见到黑社会犯罪的，有几个会阻止呢？招远麦当劳围殴案就是典型。如果仙界准入条件变为考察战斗力，一群（大于50%）人要离开仙界，他们能去哪？怕是要呆在鬼界呢，仙界觉得这样中国社会会更糟，也许他们是有道理的。我曾呆在冥界的时候，觉得仙界的领导是那么无能，让中华民众这么软弱，大家都在混日子，但进入人类社会现实生活和大众百姓相处之后，觉得治国也没我想的那样简单，所以就不发表看法了。
TEXT;
$timestamp = date('Y年n月j日H:i:s', filemtime(__FILE__));
echo "<h1>$title</h1><p style=\"line-height:1.8;max-width:30em\">（无限连载，最后编辑于${timestamp}）<br><br>";
$lines = explode("\n",$text);
foreach($lines as $l) {
	echo $l;
	echo '<br>';
}
}
